%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        Εργασία Δημητριάδη Σωκράτη Α.Μ.:359        %&%
%&%                                                   %&%
%&%    Τ.08 - ΘΕΜΑΤΑ ΨΗΦΙΑΚΗΣ ΕΠΕΞΕΡΓΑΣΙΑΣ ΕΙΚΟΝΑΣ    %&%
%&%          ΣΥΜΠΙΕΣΗ ΚΑΙ ΥΠΕΡΑΝΑΛΥΣΗ ΒΙΝΤΕΟ          %&%
%&%                                                   %&%
%&%           2Η ΠΡΟΓΡΑΜΜΑΤΙΣΤΙΚΗ ΑΣΚΗΣΗ              %&%
%&%              Συνάρτηση 'subsample'                %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------
% Η συνάρτηση 'subsample', είναι υπεύθυνη για το
% έργο της υποδειγματοληψίας των εικόνων που θα
% χρησιμοποιηθούν στη διαδικασία της SR ανακατασκευής.
% Παίρνει ως είσοδο έναν πίνακα M και έναν ακέραιο l και
% επιστρέφει τον πίνακα της υποδειγματοληψίας y.
function y=subsample(M,l)

[m,n]=size(M); % Υπολογισμός των διαστάσεων της εικόνας
y=zeros(m/l,n/l); % Αρχικοποίηση της εικόνας-εξόδου

for i=1:floor(m/l) % Η υποδειγματοληψία γίνεται, επιλέγοντας
    for j=1:floor(n/l) % ένα στοιχείο ανά l στοιχεία εικόνας
        y(i,j)=M(i*l-l+1,j*l-l+1); % για τη νέα εικόνα
    end
end
