%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        Εργασία Δημητριάδη Σωκράτη Α.Μ.:359        %&%
%&%                                                   %&%
%&%    Τ.08 - ΘΕΜΑΤΑ ΨΗΦΙΑΚΗΣ ΕΠΕΞΕΡΓΑΣΙΑΣ ΕΙΚΟΝΑΣ    %&%
%&%          ΣΥΜΠΙΕΣΗ ΚΑΙ ΥΠΕΡΑΝΑΛΥΣΗ ΒΙΝΤΕΟ          %&%
%&%                                                   %&%
%&%           2Η ΠΡΟΓΡΑΜΜΑΤΙΣΤΙΚΗ ΑΣΚΗΣΗ              %&%
%&%              Συνάρτηση 'upsample'                 %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------
% Η συνάρτηση 'upsample', είναι υπεύθυνη για το
% έργο της συμπλήρωσης, των εικόνων που προέκυψαν κατά 
% την υποδειγματοληψία, με μηδενικά. 
% Παίρνει ως είσοδο έναν πίνακα M και έναν ακέραιο l και
% επιστρέφει τον νέο πίνακα συμπληρωμένο.
function y=upsample(M,l)

[m,n]=size(M); % Υπολογισμός των διαστάσεων της εικόνας
y=zeros(m*l,n*l); % Αρχικοποίηση της εικόνας-εξόδου

for i=1:m % Η συμπλήρωση, γίνεται απλώς
    for j=1:n % τοποθετώντας τα στοιχεία του Μ
        y(i*l-l+1,j*l-l+1)=M(i,j); % στις κατάλληλες θέσεις
    end % ενώ οι υπόλοιπες έχουν ήδη μηδενικά λόγω αρχικοποίησης
end
